In [1]:
import pandas as pd

In [2]:
dados = pd.read_excel("Dados.xlsx")

In [3]:
dados.head()

,BusinessEntityID,PersonType,NameStyle,Title,FirstName,MiddleName,LastName,Suffix,EmailPromotion
0,1,EM,0,NaN,Ken,J,Sánchez,NaN,0
1,2,EM,0,NaN,Terri,Lee,Duffy,NaN,1
2,3,EM,0,NaN,Roberto,NaN,Tamburello,NaN,0
3,4,EM,0,NaN,Rob,NaN,Walters,NaN,0
4,5,EM,0,Ms.,Gail,A,Erickson,NaN,0

In [7]:
# Selecionando uma ou n colunas por índice
dados["MiddleName"].head()

0      J
1    Lee
2    NaN
3    NaN
4      A
Name: MiddleName, dtype: object

In [10]:
dados[["FirstName", "MiddleName"]].head()

  FirstName MiddleName
0       Ken          J
1     Terri        Lee
2   Roberto        NaN
3       Rob        NaN
4      Gail          A

In [12]:
# Selecionado por notação de ponto
dados.MiddleName.head()

0      J
1    Lee
2    NaN
3    NaN
4      A
Name: MiddleName, dtype: object

In [18]:
# Adicionando coluna nova
dados["nome_completo"] = dados["FirstName"] + " " + dados["LastName"]

In [19]:
dados.head()

,BusinessEntityID,PersonType,NameStyle,Title,FirstName,MiddleName,LastName,Suffix,EmailPromotion,nome_completo
0,1,EM,0,NaN,Ken,J,Sánchez,NaN,0,Ken Sánchez
1,2,EM,0,NaN,Terri,Lee,Duffy,NaN,1,Terri Duffy
2,3,EM,0,NaN,Roberto,NaN,Tamburello,NaN,0,Roberto Tamburello
3,4,EM,0,NaN,Rob,NaN,Walters,NaN,0,Rob Walters
4,5,EM,0,Ms.,Gail,A,Erickson,NaN,0,Gail Erickson